[{"feedAuthor":"","feedTitle":"Virtualization Howto","firstFetched":"2024-12-30T14:04:12.610825128Z","homepage":"https://www.virtualizationhowto.com/","link":"https://www.virtualizationhowto.com/2024/12/portainer-alternative-komodo-for-docker-stack-management-and-deployment/","published":"2024-12-30T13:52:58Z","summary":"I really like free and open source solutions that allow doing amazing things in the home lab and even in production environments.  Recently, I stumbled on a project called Komodo.  It allows having a full build and deployment solution in your Docker environment...","title":"Portainer Alternative Komodo for Docker Stack Management and Deployment"},{"feedAuthor":"","feedTitle":"Schneier on Security","firstFetched":"2024-12-30T12:06:40.025789474Z","homepage":"https://www.schneier.com/","link":"https://www.schneier.com/blog/archives/2024/12/salt-typhoons-reach-continues-to-grow.html","published":"2024-12-30T12:05:00Z","summary":"The US government has identified a ninth telecom that was successfully hacked by Salt Typhoon.","title":"Salt Typhoon’s Reach Continues to Grow"},{"feedAuthor":"bendaubney","feedTitle":"Ben Daubney","firstFetched":"2024-12-30T11:03:39.844606075Z","homepage":"https://bendaubney.com/","link":"https://bendaubney.com/2024-album-of-the-year/","published":"2024-12-30T10:00:00Z","summary":"Previously: 2024 albums of the year - the not-quite-but-still-good runners-up\n\nJamie xx - In Waves\n\nWhether you realise it or not, your own prejudice dictates the music you listen to, pay attention to, or let pass you by. \nA song can be slaved over by a dozen highly skilled professionals and refined to be an exquisite aural marvel, but if that song is released 'by' a girl in her early twenties there'll be a group of people who see it as somehow inferior to something knocked out in half an hour by some limp-haired guy with a guitar in his garage.  You dictate the 'worth' of all art with all sorts of weird and irrational cultural biases...","title":"2024 album of the year"},{"feedAuthor":"brandonsblog","feedTitle":"Brandon's Journal","firstFetched":"2024-12-30T07:04:15.961573313Z","homepage":"https://brandons-journal.com/","link":"https://brandons-journal.com/my-weight/","published":"2024-12-30T04:50:00Z","summary":"In November 2022, I received a phone call from my doctor that something was off with my blood work, and they wanted to run some tests.  That was the scariest phone call I ever took.  My mind immediately went to the worst possible outcomes, and I stood in a parking lot with tears running down my face...","title":"My Weight"}]
