[{"feedAuthor":"HashiCorp, Inc.","feedTitle":"HashiCorp Blog","firstFetched":"2024-07-11T21:54:33.532664987Z","homepage":"https://hashicorp.com/blog","link":"https://www.hashicorp.com/blog/from-zero-to-hero-hashicorp-boundary","published":"2024-07-10T18:00:00Z","summary":"Boundary takes a platform-engineering approach to secure remote access.  Learn how to create a Boundary cluster from scratch and build a secure infrastructure access workflow that helps you realize its value","title":"From zero to hero with HashiCorp Boundary"},{"feedAuthor":"","feedTitle":"Immich Blog","firstFetched":"2024-07-11T21:54:33.532664987Z","homepage":"https://immich.app/blog","link":"https://immich.app/blog/2024/update-july-2024","published":"2024-07-10T16:14:02Z","summary":"Hello everybody.  Alex from Immich here and I am back with another development progress update for the project","title":"Immich Update - July 2024"},{"feedAuthor":"","feedTitle":"Whatever","firstFetched":"2024-07-11T21:54:33.532664987Z","homepage":"https://whatever.scalzi.com","link":"https://whatever.scalzi.com/2024/07/10/every-image-a-goth-album-cover/","published":"2024-07-10T12:09:39Z","summary":"Went on a walk yesterday at the local nature reserve with Krissy and Charlie, and it was a lovely sunny day and the nature reserve was full of color and light.  So of course I had to make a series of moody black and white photos about it.  I ended up with a bunch of […]","title":"Every Image a Goth Album Cover"},{"feedAuthor":"","feedTitle":"Schneier on Security","firstFetched":"2024-07-11T21:54:33.532664987Z","homepage":"https://www.schneier.com","link":"https://www.schneier.com/blog/archives/2024/07/radius-vulnerability.html","published":"2024-07-10T14:42:11Z","summary":"New attack against the RADIUS authentication protocol:\nThe Blast-RADIUS attack allows a man-in-the-middle attacker between the RADIUS client and server to forge a valid protocol accept message in response to a failed authentication request.  This forgery could give the attacker access to network devices and services without the attacker guessing or brute forcing passwords or shared secrets.  The attacker does not learn user credentials...","title":"RADIUS Vulnerability"},{"feedAuthor":"fictionalwolfe","feedTitle":"Fictional Wolfe","firstFetched":"2024-07-11T21:54:33.532664987Z","homepage":"https://fictionalwolfe.bearblog.dev/","link":"https://fictionalwolfe.bearblog.dev/are-we-alone/","published":"2024-07-10T18:46:11.163584Z","summary":"EXCLUSIVE: Emily Chu reporting — This just in.  Our intrepid reporter, Harry J.  Canis (who's embedded at the UN Alpha Base) has managed to acquire screenshots from the Mars Orbit Observation satellite, featuring Lt...","title":"Are We Alone"},{"feedAuthor":"Jason","feedTitle":"stuff\u0026things","firstFetched":"2024-07-11T21:54:33.532664987Z","homepage":"https://stuffandthings.lol/","link":"https://stuffandthings.lol/2024-07-10_rss_fix/","published":"2024-07-10T00:00:00Z","summary":"I think I might've fixed my RSS feed and it's push to EchoFeed thanks to the 11ty Discord.  This is a post to test that theory and then I'll follow up.  I'm not sure my fix is the most attractive, but it's working for now","title":"RSS and EchoFeed Fix"},{"feedAuthor":"awolfe","feedTitle":"Alexandra's Notebook","firstFetched":"2024-07-11T21:54:33.532664987Z","homepage":"https://alexandrawolfe.ca/","link":"https://alexandrawolfe.ca/re-15-books-with-the-most-impact/","published":"2024-07-09T13:07:00Z","summary":"I just read Lou Plummer's 15 Books With The Most Impact, and started thinking about what books had an impact on me (if any) when growing up, and as an adult.  I have to say, they are all probably obscure books to the general reader, and it's not for the most obvious of reasons that each made my list.  But each book offered up a new way of looking at not only life, but myself...","title":"Re: 15 Books With The Most Impact"},{"feedAuthor":"Scarlett Cavendish","feedTitle":"CrankySec","firstFetched":"2024-07-11T21:54:33.532664987Z","homepage":"https://crankysec.com/","link":"https://crankysec.com/blog/learning/","published":"2024-07-09T00:00:00Z","summary":"The other day on our Discord, I linked to the Chicago Electrical Code to maybe make some obvious point about the need for standards and the enforcing of said standards.  I don't remember, so don't quote me.  The subject kind of ballooned from there, and it got me reading things like the NERC CIP, the fucking National Highway Institute's Design and construction of the Driven Pile Foundations - Volume I (thanks, Grady), shit from the ASTM International (née American Society for Testing and Materials), the IEEE, ANSI, ISO, NIST, the European Committee for Standardization, BSI, and things of that nature...","title":"We don't learn"},{"feedAuthor":"yordi","feedTitle":"Yordi","firstFetched":"2024-07-11T21:54:33.532664987Z","homepage":"https://yordi.me/","link":"https://yordi.me/i-think-im-quite-ready-for-another-adventure/","published":"2024-07-09T10:35:00Z","summary":"How a spontaneous bus trip sparked a love for travel and inspired dreams of an adventure across Europe","title":"I Think I'm Quite Ready for Another Adventure"},{"feedAuthor":"","feedTitle":"Whatever","firstFetched":"2024-07-11T21:54:33.532664987Z","homepage":"https://whatever.scalzi.com","link":"https://whatever.scalzi.com/2024/07/09/the-big-idea-sarah-beth-durst-4/","published":"2024-07-09T12:30:53Z","summary":"It’s time to save the universe.  Or is it.  In this Big Idea for The Spellshop, author Sarah Beth Durst makes the argument that sometimes you don’t have to save the whole universe to have a terrific story, and to have that story make a difference for its characters...","title":"The Big Idea: Sarah Beth Durst"}]
