[{"feedAuthor":"","feedTitle":"Schneier on Security","firstFetched":"2024-11-14T12:06:43.850377925Z","homepage":"https://www.schneier.com/","link":"https://www.schneier.com/blog/archives/2024/11/new-ios-security-feature-makes-it-harder-for-police-to-unlock-seized-phones.html","published":"2024-11-14T12:05:26Z","summary":"Everybody is reporting about a new security iPhone security feature with iOS 18: if the phone hasn’t been used for a few days, it automatically goes into its “Before First Unlock” state and has to be rebooted. \nThis is a really good security feature.  But various police departments don’t like it, because it makes it harder for them to unlock suspects’ phones...","title":"New iOS Security Feature Makes It Harder for Police to Unlock Seized Phones"},{"feedAuthor":"","feedTitle":"Robb Knight • Posts • RSS Feed","firstFetched":"2024-11-14T10:05:01.199496637Z","homepage":"https://rknight.me","link":"https://rknight.me/blog/flatiron-mac-and-cheese-recipe/","published":"2024-11-14T10:00:00Z","summary":"This recipe came to me via my friend Ali, who had it at The Flatiron Room when he was living in New York.  He's made it for us a bunch of times, including on my stag do, as you can in the accompanying photo. \nAs an aside, my stag do was three of us in a cabin in the middle of the Welsh countryside for three days and it was glorious...","title":"Flatiron Mac and Cheese Recipe"},{"feedAuthor":"brandonsblog","feedTitle":"Brandon's Journal","firstFetched":"2024-11-14T06:05:40.91975424Z","homepage":"https://brandons-journal.com/","link":"https://brandons-journal.com/the-nomad-a-somewhat-timely-look-at-a-captain-america-new/","published":"2024-11-14T05:47:00Z","summary":"In 1974, following Watergate, Marvel Comics had a storyline that featured a terrorist group called The Secret Empire.  The group was led by Number One, a character whose face we never see, but it's heavily hinted (like hit you on the top of the head hinted) that it is then president Richard Nixon. \nThe Secret Empire coordinated a smear campaign against Captain America that turned the American public against him...","title":"The Nomad - A Somewhat Timely Look at Captain America"},{"feedAuthor":"","feedTitle":"annie's blog","firstFetched":"2024-11-14T04:04:51.099664178Z","homepage":"https://anniemueller.com","link":"https://anniemueller.com/posts/in-praise-of-creating-crap","published":"2024-11-14T03:54:22Z","summary":"See also: Share your shit, and Don’t wait for tomorrow - Start now, and Please please please please please please share your big dumb beautiful self with the world\n\nHumans are easy","title":"In praise of creating crap"}]
