[{"feedAuthor":"livingoutloud","feedTitle":"Living Out Loud","firstFetched":"2024-11-18T16:05:00.59342583Z","homepage":"https://louplummer.lol/","link":"https://louplummer.lol/the-stories-we-tell/","published":"2024-11-18T13:40:00Z","summary":"Life is full of little moments we love to recount later.  Here's a small collection of some of my favorites","title":"The Stories We Tell"},{"feedAuthor":"","feedTitle":"Robb Knight • Posts • RSS Feed","firstFetched":"2024-11-18T16:05:00.59342583Z","homepage":"https://rknight.me","link":"https://rknight.me/blog/useful-bluesky-tools/","published":"2024-11-18T15:15:19Z","summary":"I've been helping getting MacStories setup on Bluesky this weekend and I came across a few handy sites.  There are loads of interesting Bluesky-related links in this awesome-bluesky list on GitHub, below is just the ones I happened upon and found useful. \nClearSky allows you to see which lists (starter packs) you're in, who you've blocked and who's blocked you...","title":"Useful Bluesky Tools"},{"feedAuthor":"","feedTitle":"ntietz.com blog - technically a blog","firstFetched":"2024-11-18T16:05:00.59342583Z","homepage":"/blog/","link":"https://ntietz.com/blog/abusing-talon-eyetracker/?utm_source=atom\u0026utm_medium=feed","published":"2024-11-18T00:00:00Z","summary":"I use Talon to control my computer some of the time. \nIt's mostly voice control, but it has so many other controls built in. \nOne lets you use an eye tracker as a mouse...","title":"Abusing Talon to use my eye tracker in a project"},{"feedAuthor":"Temani Afif","feedTitle":"CSS Tip: Learn CSS the easy way","firstFetched":"2024-11-18T16:05:00.59342583Z","homepage":"https://css-tip.com/","link":"https://css-tip.com/steps/","published":"2024-11-18T00:00:00Z","summary":"You want to create a discrete animation using steps() but you struggle with its value, right.  You never know how many steps it requires and it never works as expected. \nIn most cases, adding an extra value will fix your issue...","title":"How to correctly use steps() with animations"},{"feedAuthor":"","feedTitle":"alexandra — ironic, sardonic, colonic","firstFetched":"2024-11-18T16:05:00.59342583Z","homepage":"https://alexandrawolfe.ca/","link":"https://alexandrawolfe.ca/2024/11/18/do-you-tip.html","published":"2024-11-18T15:39:11Z","summary":"Okay, here’s a really deep, deep question of the day for a Monday:\nDo you tip at coffee shops. \nThe reason I ask.  Me and mine were at the mall yesterday and, for the first time in maybe over a year, the OH wanted a sugary Starbucks confection called: coffee...","title":"Do you tip at coffee shops?"},{"feedAuthor":"Julia Evans","feedTitle":"Julia Evans","firstFetched":"2024-11-18T16:05:00.59342583Z","homepage":"http://jvns.ca","link":"https://jvns.ca/blog/2024/11/18/how-to-import-a-javascript-library/","published":"2024-11-18T09:35:42Z","summary":"I like writing Javascript without a build system\nand for the millionth time yesterday I ran into a problem where I needed to\nfigure out how to import a Javascript library in my code without using a build\nsystem, and it took FOREVER to figure out how to import it because the\nlibrary’s setup instructions assume that you’re using a build system. \nLuckily at this point I’ve mostly learned how to navigate this situation and\neither successfully use the library or decide it’s too difficult and switch to\na different library, so here’s the guide I wish I had to importing Javascript\nlibraries years ago. \nI’m only going to talk about using Javacript libraries on the frontend, and\nonly about how to use them in a no-build-system setup...","title":"Importing a frontend Javascript library without a build system"},{"feedAuthor":"","feedTitle":"Schneier on Security","firstFetched":"2024-11-18T16:05:00.59342583Z","homepage":"https://www.schneier.com/","link":"https://www.schneier.com/blog/archives/2024/11/most-of-2023s-top-exploited-vulnerabilities-were-zero-days.html","published":"2024-11-18T15:49:29Z","summary":"Zero-day vulnerabilities are more commonly used, according to the Five Eyes:\nKey Findings\nIn 2023, malicious cyber actors exploited more zero-day vulnerabilities to compromise enterprise networks compared to 2022, allowing them to conduct cyber operations against higher-priority targets.  In 2023, the majority of the most frequently exploited vulnerabilities were initially exploited as a zero-day, which is an increase from 2022, when less than half of the top exploited vulnerabilities were exploited as a zero-day. \nMalicious cyber actors continue to have the most success exploiting vulnerabilities within two years after public disclosure of the vulnerability...","title":"Most of 2023’s Top Exploited Vulnerabilities Were Zero-Days"},{"feedAuthor":"robert","feedTitle":"Robert Birming","firstFetched":"2024-11-18T14:04:13.949160714Z","homepage":"https://birming.com/","link":"https://birming.com/hope-chaos/","published":"2024-11-18T13:23:00Z","summary":"Creativity will be magical, music will be amazing, art will be beautiful, and food will be even better.  In times of chaos, culture always thrives. \n\nThat's what Swedish star chef Marcus Samuelsson says when talking about the current turbulent situation around the world...","title":"Hope in Chaos"},{"feedAuthor":"","feedTitle":"Whatever","firstFetched":"2024-11-18T14:04:13.949160714Z","homepage":"https://whatever.scalzi.com","link":"https://whatever.scalzi.com/2024/11/18/the-big-idea-alan-smale-4/","published":"2024-11-18T13:20:53Z","summary":"When you have the chance to write a sequel, you do it… right.  Well, for Alan Smale, the answer was not as straightforward as all that.  Come find out why he hesitated at first to write Radiant Sky, and why now he’s glad he did...","title":"The Big Idea: Alan Smale"},{"feedAuthor":"","feedTitle":"Robb Knight • Posts • RSS Feed","firstFetched":"2024-11-18T13:10:35.086382711Z","homepage":"https://rknight.me","link":"https://rknight.me/blog/i-was-a-guest-on-appstories-this-week/","published":"2024-11-18T12:52:40Z","summary":"The past few weeks AppStories has had a different MacStories host as a guest and this week was my turn.  In the AppStories+ pre-show we talk about the origins of Ruminate and in the main show we discuss the fediverse and ActivityPub, some of my projects, as well as my development setup.  Stick around to find out what kind of person Federico thinks I am because I'm still reeling...","title":"I Was a Guest On AppStories This Week"}]
