[{"feedAuthor":"livingoutloud","feedTitle":"Living Out Loud","firstFetched":"2024-07-29T13:06:26.343199906Z","homepage":"https://louplummer.lol/","link":"https://louplummer.lol/screen-time/","published":"2024-07-29T11:30:00Z","summary":"I don't stress over screen time because I believe it is the message, not the medium that matters","title":"Screen Time"},{"feedAuthor":"kerrik","feedTitle":"And So It Goes…","firstFetched":"2024-07-29T12:06:27.753377145Z","homepage":"https://krueger.ink/","link":"https://krueger.ink/week-notes-no-202430/","published":"2024-07-29T11:19:13.252059Z","summary":"Weekly Highlights of July 22nd - 28th:\n🎨 I finished a new art piece this week.  It's called \"Rolling Blue,\" and can be seen here.  It’s turbulent ocean waves, which I guess is a good metaphor for life these days...","title":"📝 Week Notes, No. 2024.30"},{"feedAuthor":"Temani Afif","feedTitle":"CSS Tip: Learn CSS the easy way","firstFetched":"2024-07-29T12:06:27.753377145Z","homepage":"https://css-tip.com/","link":"https://css-tip.com/count-lines/","published":"2024-07-29T00:00:00Z","summary":"By adjusting the code of the previous tip (getting the width/height of any element) we can do some intresting counting.  For example, we can count the number of lines inside a text. \n Read more","title":"Count the number of lines inside a text"},{"feedAuthor":"","feedTitle":"Schneier on Security","firstFetched":"2024-07-29T11:04:13.848756825Z","homepage":"https://www.schneier.com","link":"https://www.schneier.com/blog/archives/2024/07/new-research-in-detecting-ai-generated-videos.html","published":"2024-07-29T11:02:51Z","summary":"The latest in what will be a continuing arms race between creating and detecting videos:\nThe new tool the research project is unleashing on deepfakes, called “MISLnet”, evolved from years of data derived from detecting fake images and video with tools that spot changes made to digital video or images.  These may include the addition or movement of pixels between frames, manipulation of the speed of the clip, or the removal of frames. \nSuch tools work because a digital camera’s algorithmic processing creates relationships between pixel color values...","title":"New Research in Detecting AI-Generated Videos"},{"feedAuthor":"awolfe","feedTitle":"Alexandra's Notebook","firstFetched":"2024-07-28T17:03:43.795110924Z","homepage":"https://alexandrawolfe.ca/","link":"https://alexandrawolfe.ca/week-notes-22-28/","published":"2024-07-28T15:56:17.87794Z","summary":"Considering me and mine have been on holidays all this last week you would think I had lots to say about where we went, what we did, and what we ate.  Sadly, the weather didn't play ball and it turned out this week was spent mostly at home, and doing only local walks.  I did get to eat a decent Montreal smoked meat poutine last night, for dinner...","title":"Week Notes 22 - 28"},{"feedAuthor":"robert","feedTitle":"Robert Birming","firstFetched":"2024-07-28T16:04:55.840435187Z","homepage":"https://birming.com/","link":"https://birming.com/blogline/","published":"2024-07-28T15:48:00Z","summary":"Eriq's entry in my guestbook led me to his recent post, Going from spark to a steady fire.  He describes how passions often ignite intensely before rapidly fading away. \nI completely resonate with this, just as he did after reading my post I wish I was more dedicated:\n\nIt's ridiculous how well that echoes into what I've written above...","title":"We have a blogline"}]
