[{"feedAuthor":"bendaubney","feedTitle":"Ben Daubney","firstFetched":"2024-11-18T18:05:28.636155933Z","homepage":"https://bendaubney.com/","link":"https://bendaubney.com/yuck-or-why-bluesky-still-isnt-for-me/","published":"2024-11-18T17:30:00Z","summary":"One of the awesome people I follow on Mastodon reposted this note from another user1:\n\nPeople keep learning the wrong lessons from all this social media stuff.  \"Clearly just move to fedi\" \"Bluesky is going to be totally different\".  The lesson you needed to learn, which was how we used to do things in the good old internet we all pine for, is diversify your internet presence...","title":"Yuck (or, why Bluesky still isn't for me)"},{"feedAuthor":"","feedTitle":"Blog on Tailscale","firstFetched":"2024-11-18T17:03:57.537770634Z","homepage":"https://tailscale.com/blog/","link":"https://tailscale.com/blog/video-searxng","published":"2024-11-18T15:00:41Z","summary":"In today’s video, we’ll walk through how to install the application SearXNG in a container accessible from anywhere through Tailscale.  SearXNG is a fully open-source search engine aggregator that can combine results from services and databases across the web and present them without any compromises on your privacy","title":"Host your own metasearch engine to avoid tracking and profiling"},{"feedAuthor":"kerrik","feedTitle":"And So It Goes…","firstFetched":"2024-11-18T17:03:57.537770634Z","homepage":"https://notes.krueger.ink/","link":"https://notes.krueger.ink/week-notes-no-202446/","published":"2024-11-18T16:13:27.291045Z","summary":"Weekly Highlights of November 11th - 17th:\n🍄 I started my new job as Communications Coordinator for Real Mushrooms this week.  There’s a lot to learn, but everyone has been so welcoming and wonderful and I love my team.  It’s been interesting working PST hours, too...","title":"📝 Week Notes, No. 2024.46"},{"feedAuthor":"","feedTitle":"Schneier on Security","firstFetched":"2024-11-18T16:05:00.59342583Z","homepage":"https://www.schneier.com/","link":"https://www.schneier.com/blog/archives/2024/11/most-of-2023s-top-exploited-vulnerabilities-were-zero-days.html","published":"2024-11-18T15:49:29Z","summary":"Zero-day vulnerabilities are more commonly used, according to the Five Eyes:\nKey Findings\nIn 2023, malicious cyber actors exploited more zero-day vulnerabilities to compromise enterprise networks compared to 2022, allowing them to conduct cyber operations against higher-priority targets.  In 2023, the majority of the most frequently exploited vulnerabilities were initially exploited as a zero-day, which is an increase from 2022, when less than half of the top exploited vulnerabilities were exploited as a zero-day. \nMalicious cyber actors continue to have the most success exploiting vulnerabilities within two years after public disclosure of the vulnerability...","title":"Most of 2023’s Top Exploited Vulnerabilities Were Zero-Days"},{"feedAuthor":"","feedTitle":"alexandra — ironic, sardonic, colonic","firstFetched":"2024-11-18T16:05:00.59342583Z","homepage":"https://alexandrawolfe.ca/","link":"https://alexandrawolfe.ca/2024/11/18/do-you-tip.html","published":"2024-11-18T15:39:11Z","summary":"Okay, here’s a really deep, deep question of the day for a Monday:\nDo you tip at coffee shops. \nThe reason I ask.  Me and mine were at the mall yesterday and, for the first time in maybe over a year, the OH wanted a sugary Starbucks confection called: coffee...","title":"Do you tip at coffee shops?"},{"feedAuthor":"","feedTitle":"Robb Knight • Posts • RSS Feed","firstFetched":"2024-11-18T16:05:00.59342583Z","homepage":"https://rknight.me","link":"https://rknight.me/blog/useful-bluesky-tools/","published":"2024-11-18T15:15:19Z","summary":"I've been helping getting MacStories setup on Bluesky this weekend and I came across a few handy sites.  There are loads of interesting Bluesky-related links in this awesome-bluesky list on GitHub, below is just the ones I happened upon and found useful. \nClearSky allows you to see which lists (starter packs) you're in, who you've blocked and who's blocked you...","title":"Useful Bluesky Tools"},{"feedAuthor":"livingoutloud","feedTitle":"Living Out Loud","firstFetched":"2024-11-18T16:05:00.59342583Z","homepage":"https://louplummer.lol/","link":"https://louplummer.lol/the-stories-we-tell/","published":"2024-11-18T13:40:00Z","summary":"Life is full of little moments we love to recount later.  Here's a small collection of some of my favorites","title":"The Stories We Tell"},{"feedAuthor":"","feedTitle":"Whatever","firstFetched":"2024-11-18T14:04:13.949160714Z","homepage":"https://whatever.scalzi.com","link":"https://whatever.scalzi.com/2024/11/18/the-big-idea-alan-smale-4/","published":"2024-11-18T13:20:53Z","summary":"When you have the chance to write a sequel, you do it… right.  Well, for Alan Smale, the answer was not as straightforward as all that.  Come find out why he hesitated at first to write Radiant Sky, and why now he’s glad he did...","title":"The Big Idea: Alan Smale"},{"feedAuthor":"robert","feedTitle":"Robert Birming","firstFetched":"2024-11-18T14:04:13.949160714Z","homepage":"https://birming.com/","link":"https://birming.com/hope-chaos/","published":"2024-11-18T13:23:00Z","summary":"Creativity will be magical, music will be amazing, art will be beautiful, and food will be even better.  In times of chaos, culture always thrives. \n\nThat's what Swedish star chef Marcus Samuelsson says when talking about the current turbulent situation around the world...","title":"Hope in Chaos"},{"feedAuthor":"","feedTitle":"Robb Knight • Posts • RSS Feed","firstFetched":"2024-11-18T13:10:35.086382711Z","homepage":"https://rknight.me","link":"https://rknight.me/blog/i-was-a-guest-on-appstories-this-week/","published":"2024-11-18T12:52:40Z","summary":"The past few weeks AppStories has had a different MacStories host as a guest and this week was my turn.  In the AppStories+ pre-show we talk about the origins of Ruminate and in the main show we discuss the fediverse and ActivityPub, some of my projects, as well as my development setup.  Stick around to find out what kind of person Federico thinks I am because I'm still reeling...","title":"I Was a Guest On AppStories This Week"}]
