[{"feedAuthor":"","feedTitle":"Whatever","firstFetched":"2024-07-17T00:14:47.919690624Z","homepage":"https://whatever.scalzi.com","link":"https://whatever.scalzi.com/2024/07/16/new-cover-under-the-milky-way/","published":"2024-07-17T00:08:45Z","summary":"I got a new guitar and wanted to justify its expense by putting it into a track, so here you go: A cover of “Under the Milky Way” by The Church for way back in 1988.  My version is a little more chunky and, dare I say it, slightly more emo than the somewhat more […]","title":"New Cover: “Under the Milky Way”"},{"feedAuthor":"","feedTitle":"Ed Zitron's Where's Your Ed At","firstFetched":"2024-07-16T21:04:36.427050168Z","homepage":"https://www.wheresyoured.at/","link":"https://www.wheresyoured.at/put-up-or-shut-up/","published":"2024-07-16T20:26:39Z","summary":"I feel like the tech industry is currently in the midst of the most bizarre cognitive dissonance I've ever seen — more so than the metaverse, even — as company after company simply lies about their intentions and the power of AI.  I get it.  Everybody wants","title":"Put Up Or Shut Up"},{"feedAuthor":"awolfe","feedTitle":"Alexandra's Notebook","firstFetched":"2024-07-16T21:04:36.427050168Z","homepage":"https://alexandrawolfe.ca/","link":"https://alexandrawolfe.ca/to-speak-or-not-to-speak/","published":"2024-07-16T19:42:00Z","summary":"Day 2 of the FiftyIn50 blogging challenge, and today's topic is:\nOn what subjects are you outspoken and on what subjects are you mostly mute. \nI guess it's easier to start with my mute topics as I am more reticent about those, these days, at my age.  Not wanting to be baited into conversations with people who are entrenched in a single view in the belief there are no others...","title":"To Speak or not to Speak"},{"feedAuthor":"","feedTitle":"melkat.blog","firstFetched":"2024-07-16T20:03:53.917739919Z","homepage":"https://melkat.blog/","link":"https://melkat.blog/p/ios-18-beta","published":"2024-07-16T19:41:53Z","summary":"I've made it clear that I have a huge dislike of Apple's yearly update cycle for their software (and hardware, to be honest).  It's bad from a software perspective because you're giving people a lot of change all at once with a high probability that something will go wrong.  You're also constantly playing catch up with the rest of the world...","title":"First Impressions of iOS 18 and The Gang"}]
