[{"feedAuthor":"livingoutloud","feedTitle":"Living Out Loud","firstFetched":"2024-11-15T15:04:10.981851278Z","homepage":"https://louplummer.lol/","link":"https://louplummer.lol/ama-what-is-your-favorite-quality-in-a-person/","published":"2024-11-15T14:53:00Z","summary":"Compassionate people are my people and they are the ones who give our society any hope of greatness","title":"AMA - What is Your Favorite Quality in a Person?"},{"feedAuthor":"","feedTitle":"Robb Knight • Posts • RSS Feed","firstFetched":"2024-11-15T14:04:18.287755116Z","homepage":"https://rknight.me","link":"https://rknight.me/blog/naming-my-computers/","published":"2024-11-15T13:23:18Z","summary":"Alex has an excellent post about how they name their computers which is, as they mention, a very important part of setting up a new device. \nUnlike Alex, I don't choose a new name when it gets replaced - my iPhone is always called Starlord.  Which brings me to the naming scheme: Marvel characters...","title":"Naming My Computers"},{"feedAuthor":"","feedTitle":"Schneier on Security","firstFetched":"2024-11-15T12:06:48.010655184Z","homepage":"https://www.schneier.com/","link":"https://www.schneier.com/blog/archives/2024/11/good-essay-on-the-history-of-bad-password-policies.html","published":"2024-11-15T12:05:02Z","summary":"Stuart Schechter makes some good points on the history of bad password policies:\nMorris and Thompson’s work brought much-needed data to highlight a problem that lots of people suspected was bad, but that had not been studied scientifically.  Their work was a big step forward, if not for two mistakes that would impede future progress in improving passwords for decades. \nFirst, was Morris and Thompson’s confidence that their solution, a password policy, would fix the underlying problem of weak passwords...","title":"Good Essay on the History of Bad Password Policies"},{"feedAuthor":"","feedTitle":"Whatever","firstFetched":"2024-11-15T12:06:48.010655184Z","homepage":"https://whatever.scalzi.com","link":"https://whatever.scalzi.com/2024/11/15/the-big-idea-sharon-shinn-3/","published":"2024-11-15T11:18:53Z","summary":"For her new novel Alibi, author Sharon Shinn strays a bit from what she’s usually known for, to mix another genre of literature into her storytelling.  What mysteries has she uncovered from this process.  Read on...","title":"The Big Idea: Sharon Shinn"}]
