[{"feedAuthor":"bendaubney","feedTitle":"Ben Daubney","firstFetched":"2024-12-30T11:03:39.844606075Z","homepage":"https://bendaubney.com/","link":"https://bendaubney.com/2024-album-of-the-year/","published":"2024-12-30T10:00:00Z","summary":"Previously: 2024 albums of the year - the not-quite-but-still-good runners-up\n\nJamie xx - In Waves\n\nWhether you realise it or not, your own prejudice dictates the music you listen to, pay attention to, or let pass you by. \nA song can be slaved over by a dozen highly skilled professionals and refined to be an exquisite aural marvel, but if that song is released 'by' a girl in her early twenties there'll be a group of people who see it as somehow inferior to something knocked out in half an hour by some limp-haired guy with a guitar in his garage.  You dictate the 'worth' of all art with all sorts of weird and irrational cultural biases...","title":"2024 album of the year"},{"feedAuthor":"brandonsblog","feedTitle":"Brandon's Journal","firstFetched":"2024-12-30T07:04:15.961573313Z","homepage":"https://brandons-journal.com/","link":"https://brandons-journal.com/my-weight/","published":"2024-12-30T04:50:00Z","summary":"In November 2022, I received a phone call from my doctor that something was off with my blood work, and they wanted to run some tests.  That was the scariest phone call I ever took.  My mind immediately went to the worst possible outcomes, and I stood in a parking lot with tears running down my face...","title":"My Weight"},{"feedAuthor":"","feedTitle":"annie's blog","firstFetched":"2024-12-30T04:05:00.168422071Z","homepage":"https://anniemueller.com","link":"https://anniemueller.com/posts/one-bucket-at-a-time","published":"2024-12-30T03:24:03Z","summary":"If you try to optimize everything, you will fail at everything. \n\nThink of all the stuff of your life as a big lake of clear, cool water.  You’re in a","title":"One bucket at a time"},{"feedAuthor":"livingoutloud","feedTitle":"Living Out Loud","firstFetched":"2024-12-30T03:09:30.925774703Z","homepage":"https://louplummer.lol/","link":"https://louplummer.lol/remembering-jimmy-carter/","published":"2024-12-30T01:46:00Z","summary":"I knew Jimmy Carter was a great man in 1976 and my opinion never wavered.  Our country will miss him","title":"Remembering Jimmy Carter"}]
